In [ ]:
# data is usually stored in flat tables only giving the different columns and data points. If you want to find some information
# from few columns of the table and summarize it is a neat way, we use pivot tables. **Look at Wikipedia example.**

In [1]:
import pandas as pd
import numpy as np
from pandas import Series,DataFrame

In [18]:
df1_flat_table = DataFrame({'Gender':['Boy','Girl','Boy','Boy','Girl','Boy','Girl','Girl','Girl','Boy'],'Age':[2,7,1,9,3,5,8,21,10,20],
                            'State':['ON','ON','AB','BC','BC','MB','ON','AB','SK','SK']})
df1_flat_table.columns.name = 'Info'
df1_flat_table.index.name = 'Number'
df1_flat_table

# instead of specifying index and column values in [] and setting name separately, we can use index = pd.index(['values'],'Name')

Info   Gender  Age State
Number
0         Boy    2    ON
1        Girl    7    ON
2         Boy    1    AB
3         Boy    9    BC
4        Girl    3    BC
5         Boy    5    MB
6        Girl    8    ON
7        Girl   21    AB
8        Girl   10    SK
9         Boy   20    SK

In [24]:
# now if we want information or summary about the sum of ages of each gender state wise
piv_table = df1_flat_table.pivot_table(index='Gender',columns='State',values='Age',aggfunc='sum') #(row,column,data points to be filled out)
piv_table

State     AB   BC   MB    ON    SK
Gender
Boy      1.0  9.0  5.0   2.0  20.0
Girl    21.0  3.0  NaN  15.0  10.0

In [ ]:
# we can also use pivot function. but pivot is throwing error when the index and column combination has duplicates. 
# example, in our df, we have two Girl,ON entries. when pivoting pandas doesn't understand
# what to do with age values of these two entries. We use the more generalized pivot_table function and specify aggfunc parameter
# to let pandas know how we would want to handle it. By default it does average. If we want sum of the age values, above is done.

In [ ]:
# pivot makes it easy to view infomration by avoiding repeated information, arranging them as indexes and columns (gender and state)